# ConceptualConstructionIsByEnergyData Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassLevelData..::..ConceptualConstructionIsByEnergyData Property
MassLevelData Class See Also
---
Indicates if the ConceptualConstructionType of the MassLevelData (Mass Floor) is synchronized with the EnergyDataSettings or if it overrides those settings.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool ConceptualConstructionIsByEnergyData { get; set; }
```

Visual Basic
---
```text
Public Property ConceptualConstructionIsByEnergyData As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ConceptualConstructionIsByEnergyData {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: ConceptualConstructionIsByEnergyData cannot be set to conceptualConstructionIsByEnergyData. |

# See Also
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace